Конфигурация/src/Documents/БронированиеНомера/БронированиеНомера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>БронированиеНомера</name>
  <registerRecords>InformationRegister.БронированиеНомеров</registerRecords>
  <attributes>
    <name>ОсновнойГость</name>
    <type>
      <types>CatalogRef.Гости</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГостей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаезда</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьПребывания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыезда</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БронируемыйНомер</name>
    <type>
      <types>CatalogRef.НомернойФонд</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <comment>Цена номера за ночь</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/InformationRegisters/БронированиеНомеров/БронированиеНомеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БронированиеНомеров</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаКонца</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СтатусБрони</name>
    <type>
      <types>EnumRef.СтатусБронирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтменаБрони</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Гость</name>
    <type>
      <types>CatalogRef.Гости</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>CatalogRef.НомернойФонд</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конфигурация/src/Documents/БронированиеНомера/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Проверка на число гостей
    Движения.БронированиеНомеров.Записывать = Истина;
    Движения.Записать();

		
	Если КоличествоГостей > БронируемыйНомер.МаксимальноеКоличествоГостей Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон(
		    "Указано гостей: %1, максимум для номера: %2. Выберите другой номер.",
		    КоличествоГостей,
		    БронируемыйНомер.МаксимальноеКоличествоГостей
		);
		Сообщение.Поле = "КоличествоГостей";
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	БронированиеНомеровСрезПоследних.ДатаКонца КАК ДатаКонца,
		|	БронированиеНомеровСрезПоследних.ДатаНачала КАК ДатаНачала,
		|	БронированиеНомеровСрезПоследних.Номер КАК Номер
		|ИЗ
		|	РегистрСведений.БронированиеНомеров.СрезПоследних(&Дата, ДатаНачала >= &ДатаНач
		|	И ДатаНачала <= &ДатаКон) КАК БронированиеНомеровСрезПоследних";
		

		
		Запрос.УстановитьПараметр("Номер", БронируемыйНомер);
		Запрос.УстановитьПараметр("ДатаНач", ДатаЗаезда);
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("ДатаКон", ДатаВыезда);
		
		//Запрос.УстановитьПараметр("ДатаКонца", ДатаВыезда);
		
		Результат = Запрос.Выполнить();
		ВыборкаНомер = Результат.Выбрать();
		ВыборкаНомер.Следующий();
		Если Не Результат.Пустой() Тогда
		    Сообщение = Новый СообщениеПользователю;
		    Сообщение.Текст = СтрШаблон(
		        "Номер %1 занят с %2 по %3. Выберите другие даты или номер.",
		        ВыборкаНомер.Номер,
		        Формат(ВыборкаНомер.ДатаНачала, "ДФ=dd.MM.yyyy"),
		        Формат(ВыборкаНомер.ДатаКонца, "ДФ=dd.MM.yyyy")
		    );
		    Сообщение.Поле = "БронируемыйНомер";
		    Сообщение.Сообщить();
		    Отказ = Истина;
		КонецЕсли;
		
		Если не Отказ Тогда				
			// регистр БронированиеНомеров
			Движения.БронированиеНомеров.Записывать = Истина;
			Движение = Движения.БронированиеНомеров.Добавить();
			Движение.Период = Дата;
			Движение.Номер = БронируемыйНомер;
			Движение.ДатаНачала =ДатаЗаезда;
			Движение.ДатаКонца = ДатаВыезда;
		КонецЕсли;
КонецПроцедуры
